10/data/attachments/afa83642e28352ea.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_13104b59-5eae-48e4-b3f4-b08c7f84fd6e</nif:username>
            <nif:friendToBeAdded>Stacy_traditional_Friend_97747_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>